glenn-edgar/motioncore-prototype/ra4m1/apps/register_dongle/src/control.c
// ============================================================================
// control.c — RA4M1 motor-control core (Tier 1 / Tier 2 / Tier 0).
//
// See control.h for the architecture. Bare CMSIS registers throughout, matching
// ra4m1_hal.c / mode.c. Increment 1 implements MOTOR_IDLE + MOTOR_MANUAL; the
// closed-loop modes (PID / SCURVE / WINDOW) plug into g_motor_modes[] + the
// PendSV ticks without touching the dispatch core.
//
// Register facts (RA4M1 User's Manual R01UH0887EJ0100, FSP r_gpt.c):
//   * GPT2 = the 20 kHz sample timer (16-bit channel GPT162; module-stop bit is
//     MSTPD6 in MSTPCRD, shared with GPT3..7). 20 kHz @ PCLKD 48 MHz → period
//     2400 counts. Its overflow event is routed to NVIC slot CONTROL_SAMPLE_IRQ.
//   * GPT3 = the PWM (owned by ra4m1_hal.c hal_pwm_*); the control core drives
//     it via hal_pwm_set(). GPT1 = the encoder (boot-fixed in control_init).
//   * PendSV is a Cortex-M core exception (no ICU slot). Pended by the sample
//     ISR every 20th sample → 1 kHz. The strong PendSV_Handler() below overrides
//     the weak FSP one and is picked up automatically by the relocated vector
//     table (mode.c copies it from flash, where the linker already resolved it).
// ============================================================================

#include "control.h"
#include "mode.h"          // mode_vector_install, mode_set, MODE_WORKBENCH
#include "ra4m1_hal.h"     // hal_adc_scan3_*, hal_pwm_*, hal_encoder_*, hal_gpio_*
#include "spectral.h"      // spectral_feed() — offline FFT stream consumer
#include "bsp_api.h"       // CMSIS core (SCB, NVIC_*, PendSV_IRQn) + R_* regs

// ---- H-bridge pins (Mode 1 layout: H-bridge GPIO on D4/D5) -----------------
// D4 = P206 (port 2 pin 6) = IN1 ; D5 = P100 (port 1 pin 0) = IN2.
// Direction via IN1/IN2, magnitude via the D8 PWM (TB6612-style driver).
#define HB_IN1_PORT  2u
#define HB_IN1_PIN   6u
#define HB_IN2_PORT  1u
#define HB_IN2_PIN   0u

// ---- ADC scan channels (A1 current / A2 / A3) ------------------------------
// A1 = AN000 = motor current-sense (index 0 of the scan).

// ---- timing / rates --------------------------------------------------------
#define CONTROL_SAMPLE_IRQ  5u            // free ICU/NVIC slot (USB 0..3, DSP 4)
#define GPT_PCLKD_HZ        48000000u
#define SAMPLE_RATE_HZ      20000u
#define SAMPLE_PERIOD       (GPT_PCLKD_HZ / SAMPLE_RATE_HZ)   // 2400
#define DECIM_1K            20u            // 20 kHz → 1 kHz boxcar
#define DECIM_100           10u            // 1 kHz  → 100 Hz boxcar (cascade)
#define OUTER_DIV           10u            // PendSV 1 kHz → 100 Hz outer tick
#define EMA_ALPHA           0.3f           // speed 1-pole IIR (M-method smoothing)
#define PROBE_SHIFT         8              // dac_probe fixed-point: scale>>8

// ---- GPT register bits (mirror mode.c) -------------------------------------
#define GPT_WP_UNLOCK       0x0000A500u
#define GPT_WP_LOCK         0x0000A501u
#define MSTPD_GPT27         (1u << 6)      // MSTPCRD: GPT162..167 (GPT2..GPT7)
#define GTCR_CST            (1u << 0)
#define GTINTAD_OVF         (1u << 6)      // GTINTPR = 01b: overflow IRQ
#define GTST_TCFPO          (1u << 6)
#define IELSR_IR            (1u << 16)

// GPT2 overflow ICU event. FSP elc_event_t enumerator (bsp_elc_event.h, pulled
// via bsp_api.h). If a build host can't resolve the symbol, override it with the
// literal from the RA4M1 ICU event table, e.g. -DCONTROL_GPT2_OVF_EVENT=0x06F.
// TODO-verify (Pi): confirm the symbol resolves and the timer actually fires.
#ifndef CONTROL_GPT2_OVF_EVENT
#define CONTROL_GPT2_OVF_EVENT  ELC_EVENT_GPT2_COUNTER_OVERFLOW
#endif

// ============================================================================
// Shared state. 32-bit / 16-bit scalars are read torn-free on Cortex-M4
// (single LDR/STR), so the sample ISR (highest prio) and PendSV (lower) share
// them without critical sections. `volatile` where an ISR is the writer.
// ============================================================================

static volatile motor_mode_t  g_motor_mode  = MOTOR_IDLE;
static volatile motor_state_t g_motor_state = MOTOR_STATE_IDLE;
static volatile uint8_t       g_fault       = MOTOR_FAULT_NONE;
static volatile int16_t       g_duty        = 0;        // signed PWM duty

static volatile uint16_t g_adc_raw[3] = { 0, 0, 0 };    // latest 20 kHz scan
static volatile int32_t  g_enc_pos    = 0;              // latest encoder snapshot

// Decimators (boxcar): 20k→1k then 1k→100 cascade.
static uint32_t g_acc1k[3]  = { 0, 0, 0 };
static uint32_t g_acc100[3] = { 0, 0, 0 };
static uint16_t g_cnt1k     = 0;
static uint16_t g_cnt100    = 0;
static volatile uint16_t g_out1k[3]  = { 0, 0, 0 };
static volatile uint16_t g_out100[3] = { 0, 0, 0 };

// Speed estimate (M-method @100 Hz + EMA).
static int32_t          g_enc_prev100 = 0;
static float            g_vel_f       = 0.0f;
static volatile int32_t g_velocity    = 0;             // counts/s

// PendSV outer-tick divider.
static uint16_t g_outer = 0;

// Tuning.
static volatile uint16_t g_oc_thresh = 0;              // overcurrent raw (0=off)
static uint32_t          g_counts_per_rev = 0;

// DAC probe mux.
static struct {
    volatile bool active;
    uint8_t       source;
    int16_t       scale;
    int16_t       offset;
} g_probe = { false, 0, 0, 0 };

// DAC test-signal generator (A0→A1 loopback decimation test). Mutually exclusive
// with g_probe (one DAC). Square is toggled in the 20 kHz sample ISR.
#define DACTEST_OFF    0u
#define DACTEST_CONST  1u
#define DACTEST_SQUARE 2u
static struct {
    volatile uint8_t mode;       // DACTEST_*
    uint16_t low, high;
    uint16_t half_ticks;         // 20 kHz ticks per half-period
    uint16_t counter;
    uint8_t  level;              // 0=low, 1=high
} g_dactest = { DACTEST_OFF, 0, 0, 0, 0, 0 };

// Offline spectral feed: when armed, the sample ISR pushes the selected decimated
// stream (rate × channel) into spectral_feed() at that rate's cadence.
static struct {
    volatile bool active;
    uint8_t       rate;          // CONTROL_RATE_20K / _1K / _100
    uint8_t       channel;       // 0..2 = A1/A2/A3
} g_specfeed = { false, 0, 0 };

// Encoder stimulus: software Gray-code quadrature on D4/D5 (bench self-test, no
// motor). Advanced in the 20 kHz sample ISR every step_ticks → one count/step.
static struct {
    volatile bool active;
    uint16_t      step_ticks;    // 20 kHz ticks per Gray step (= SAMPLE_RATE_HZ/rate)
    uint16_t      counter;
    uint8_t       idx;           // 0..3 Gray index
    uint8_t       dir;           // 1 = forward, 0 = reverse
} g_encstim = { false, 0, 0, 0, 1 };

// ============================================================================
// H-bridge helpers (register-level writes; ISR-safe).
// ============================================================================

