glenn-edgar/motioncore-prototype/ra4m1/apps/register_dongle/src/control.c
static inline void hbridge_coast(void)
{
    hal_gpio_write(HB_IN1_PORT, HB_IN1_PIN, false);
    hal_gpio_write(HB_IN2_PORT, HB_IN2_PIN, false);
    hal_pwm_set(0u);
}

// Apply a signed duty: direction via IN1/IN2, magnitude via PWM. A latched
// fault forces coast regardless of the requested duty.
static void hbridge_apply(int16_t duty)
{
    if (g_fault != MOTOR_FAULT_NONE) {
        hbridge_coast();
        g_duty = 0;
        g_motor_state = MOTOR_STATE_FAULT;
        return;
    }
    int32_t mag = (duty < 0) ? -(int32_t)duty : (int32_t)duty;
    if (mag > 4095) mag = 4095;

    if (duty > 0) {
        hal_gpio_write(HB_IN1_PORT, HB_IN1_PIN, true);
        hal_gpio_write(HB_IN2_PORT, HB_IN2_PIN, false);
    } else if (duty < 0) {
        hal_gpio_write(HB_IN1_PORT, HB_IN1_PIN, false);
        hal_gpio_write(HB_IN2_PORT, HB_IN2_PIN, true);
    } else {
        hal_gpio_write(HB_IN1_PORT, HB_IN1_PIN, false);
        hal_gpio_write(HB_IN2_PORT, HB_IN2_PIN, false);
    }
    hal_pwm_set((uint16_t)mag);
    g_duty = duty;
    g_motor_state = (mag > 0) ? MOTOR_STATE_RUNNING : MOTOR_STATE_IDLE;
}

// ============================================================================
// DAC probe mux.
// ============================================================================

static void probe_write(int32_t value)
{
    int32_t v = ((value * (int32_t)g_probe.scale) >> PROBE_SHIFT)
              + (int32_t)g_probe.offset;
    if (v < 0)    v = 0;
    if (v > 4095) v = 4095;
    hal_dac_write((uint16_t)v);
}

// Sources freshest at the 20 kHz tick: raw scan 0..2 + motor current.
static void probe_emit_20k(const uint16_t s[3])
{
    if (!g_probe.active) return;
    switch (g_probe.source) {
        case PROBE_A1_20K:  probe_write(s[0]); break;
        case PROBE_A2_20K:  probe_write(s[1]); break;
        case PROBE_A3_20K:  probe_write(s[2]); break;
        case PROBE_CURRENT: probe_write(s[0]); break;
        default: break;     // other sources emitted from the PendSV ticks
    }
}

// Sources freshest at the control ticks: decimated streams + control vars.
static void probe_emit_ctrl(void)
{
    if (!g_probe.active) return;
    switch (g_probe.source) {
        case PROBE_A1_1K:    probe_write(g_out1k[0]);  break;
        case PROBE_A2_1K:    probe_write(g_out1k[1]);  break;
        case PROBE_A3_1K:    probe_write(g_out1k[2]);  break;
        case PROBE_A1_100:   probe_write(g_out100[0]); break;
        case PROBE_A2_100:   probe_write(g_out100[1]); break;
        case PROBE_A3_100:   probe_write(g_out100[2]); break;
        case PROBE_SPEED:    probe_write(g_velocity);  break;
        case PROBE_POSITION: probe_write(g_enc_pos);   break;
        case PROBE_DUTY:     probe_write(g_duty);      break;
        default: break;     // 20 kHz sources emitted from the sample ISR
    }
}

// ============================================================================
// Speed estimate — M-method (fixed-time counting) @100 Hz + 1-pole EMA.
// ============================================================================

static void speed_update(void)
{
    int32_t pos = g_enc_pos;                       // atomic 32-bit read
    int32_t d   = pos - g_enc_prev100;             // modular: 32-bit wrap-safe
    g_enc_prev100 = pos;
    float vraw = (float)d * (float)(SAMPLE_RATE_HZ / DECIM_1K / OUTER_DIV); // ×100
    g_vel_f += EMA_ALPHA * (vraw - g_vel_f);
    g_velocity = (int32_t)g_vel_f;
}

// ============================================================================
// Motor-mode descriptor table.
// ============================================================================

typedef struct {
    void (*on_enter)(void);
    void (*on_exit)(void);
    void (*tick_1k)(void);     // PendSV inner — torque/current loop + safety
    void (*tick_100)(void);    // PendSV outer — speed/velocity/position/profile
} motor_desc_t;

// Forward decls of the sampling lifecycle (used by mode enters).
static void sampling_start(void);
static void sampling_stop(void);

// ---- MOTOR_IDLE ------------------------------------------------------------
static void idle_on_enter(void)
{
    sampling_stop();
    hbridge_coast();
    g_duty = 0;
    g_motor_state = MOTOR_STATE_IDLE;
}

// ---- MOTOR_MANUAL ----------------------------------------------------------
static void manual_on_enter(void)
{
    g_fault = MOTOR_FAULT_NONE;
    hal_pwm_config(20000u);          // boot/mode-fixed 20 kHz motor PWM
    hal_pwm_set(0u);
    hal_gpio_config(HB_IN1_PORT, HB_IN1_PIN, true, false);
    hal_gpio_config(HB_IN2_PORT, HB_IN2_PIN, true, false);
    hbridge_coast();
    g_duty = 0;
    sampling_start();                // 20 kHz ADC scan + control ticks live
    g_motor_state = MOTOR_STATE_IDLE;
}

static void manual_on_exit(void)
{
    sampling_stop();
    hbridge_coast();
}

static const motor_desc_t g_motor_modes[MOTOR_MODE_COUNT] = {
    [MOTOR_IDLE]   = { idle_on_enter,   NULL,          NULL, NULL },
    [MOTOR_MANUAL] = { manual_on_enter, manual_on_exit, NULL, NULL },
    // [MOTOR_PID] / [MOTOR_SCURVE] / [MOTOR_WINDOW] — added with their increments.
};

#define MOTOR_MODE_MAX_IMPLEMENTED  MOTOR_MANUAL

// ============================================================================
// Tier 1 — 20 kHz sample ISR (GPT2 overflow).
// ============================================================================

void control_sample_isr(void)
{
    // Clear the GPT2 overflow + ICU latch (mode.c ordering).
    R_GPT2->GTST &= ~GTST_TCFPO;
    (void)R_GPT2->GTST;
    R_ICU->IELSR[CONTROL_SAMPLE_IRQ] &= ~IELSR_IR;

    // 3-channel scan (A1 current / A2 / A3) + encoder snapshot.
    uint16_t s[3];
    hal_adc_scan3_read(s);
    g_adc_raw[0] = s[0];
    g_adc_raw[1] = s[1];
    g_adc_raw[2] = s[2];
    g_enc_pos = hal_encoder_read();

    // Fast-path overcurrent cutout (safety reacts here, not at 1 kHz).
    if (g_oc_thresh != 0u && s[0] > g_oc_thresh) {
        hbridge_coast();
        g_fault = MOTOR_FAULT_OVERCURRENT;
        g_duty = 0;
        g_motor_state = MOTOR_STATE_FAULT;
    }

    // Boxcar decimation 20k→1k, cascaded 1k→100.
    for (uint32_t i = 0; i < 3; i++) {
        g_acc1k[i] += s[i];
    }
    if (++g_cnt1k >= DECIM_1K) {
        g_cnt1k = 0;
        for (uint32_t i = 0; i < 3; i++) {
            uint16_t v = (uint16_t)(g_acc1k[i] / DECIM_1K);
            g_out1k[i]  = v;
            g_acc100[i] += v;
            g_acc1k[i]   = 0;
        }
        if (g_specfeed.active && g_specfeed.rate == CONTROL_RATE_1K) {
            spectral_feed(g_out1k[g_specfeed.channel]);    // 1 kHz stream → FFT
        }
        if (++g_cnt100 >= DECIM_100) {
            g_cnt100 = 0;
            for (uint32_t i = 0; i < 3; i++) {
                g_out100[i]  = (uint16_t)(g_acc100[i] / DECIM_100);
                g_acc100[i]  = 0;
            }
            if (g_specfeed.active && g_specfeed.rate == CONTROL_RATE_100) {
                spectral_feed(g_out100[g_specfeed.channel]);   // 100 Hz stream → FFT
            }
        }
        // 1 kHz boundary → pend the control math (PendSV, lower priority).
        SCB->ICSR = SCB_ICSR_PENDSVSET_Msk;
    }

    probe_emit_20k(s);

    if (g_specfeed.active && g_specfeed.rate == CONTROL_RATE_20K) {
        spectral_feed(s[g_specfeed.channel]);              // 20 kHz stream → FFT
    }

    // DAC test-signal generator (square): toggle low↔high every half-period,
    // phase-locked to the 20 kHz sample clock — for the A0→A1 decimation
    // loopback test. (const mode is written at command time.)
    if (g_dactest.mode == DACTEST_SQUARE) {
        if (++g_dactest.counter >= g_dactest.half_ticks) {
            g_dactest.counter = 0;
            g_dactest.level ^= 1u;
            hal_dac_write(g_dactest.level ? g_dactest.high : g_dactest.low);
        }
    }

    // Encoder stimulus: advance the Gray-code quadrature on D4/D5 (one count per
    // step) — for the D4→D10 / D5→D9 encoder loopback self-test.
    if (g_encstim.active) {
        if (++g_encstim.counter >= g_encstim.step_ticks) {
            g_encstim.counter = 0;
            g_encstim.idx = (uint8_t)((g_encstim.idx + (g_encstim.dir ? 1u : 3u)) & 3u);
            uint8_t a = (g_encstim.idx == 1u || g_encstim.idx == 2u) ? 1u : 0u;
            uint8_t b = (g_encstim.idx == 2u || g_encstim.idx == 3u) ? 1u : 0u;
            hal_gpio_write(HB_IN1_PORT, HB_IN1_PIN, a != 0u);   // D4 → phase A (D10/GTIOC1A)
            hal_gpio_write(HB_IN2_PORT, HB_IN2_PIN, b != 0u);   // D5 → phase B (D9/GTIOC1B)
        }
    }
}

// ============================================================================
// Tier 2 — PendSV (1 kHz inner + 100 Hz outer). Pended by the sample ISR.
// ============================================================================

void PendSV_Handler(void)
{
    motor_mode_t m = g_motor_mode;
    const motor_desc_t* d = &g_motor_modes[m];

    // 1 kHz inner: torque/current loop + safety (per active mode).
    if (d->tick_1k) d->tick_1k();

