glenn-edgar/motioncore-prototype/ra4m1/apps/register_dongle/src/control.c
    // 100 Hz outer: shared speed estimate + the mode's velocity/position/profile.
    if (++g_outer >= OUTER_DIV) {
        g_outer = 0;
        speed_update();
        if (d->tick_100) d->tick_100();
    }

    probe_emit_ctrl();
}

// ============================================================================
// GPT2 20 kHz sample timer.
// ============================================================================

static void gpt2_start(void)
{
    R_MSTP->MSTPCRD &= ~MSTPD_GPT27;            // ungate GPT2..7
    (void)R_MSTP->MSTPCRD;

    R_GPT2->GTWP     = GPT_WP_UNLOCK;
    R_GPT2->GTCR     = 0u;                      // MD=000 saw-wave, /1, stopped
    R_GPT2->GTUDDTYC = 3u;                      // latch count-up...
    R_GPT2->GTUDDTYC = 1u;                      // ...clear the force bit
    R_GPT2->GTPR     = SAMPLE_PERIOD - 1u;
    R_GPT2->GTPBR    = SAMPLE_PERIOD - 1u;
    R_GPT2->GTCNT    = 0u;
    R_GPT2->GTST     = 0u;
    R_GPT2->GTINTAD  = GTINTAD_OVF;             // overflow IRQ
    R_GPT2->GTWP     = GPT_WP_LOCK;

    R_ICU->IELSR[CONTROL_SAMPLE_IRQ] = (uint32_t)CONTROL_GPT2_OVF_EVENT;
    NVIC_ClearPendingIRQ((IRQn_Type)CONTROL_SAMPLE_IRQ);
    NVIC_SetPriority((IRQn_Type)CONTROL_SAMPLE_IRQ, 1u);   // above PendSV (3)
    NVIC_EnableIRQ((IRQn_Type)CONTROL_SAMPLE_IRQ);

    R_GPT2->GTWP  = GPT_WP_UNLOCK;
    R_GPT2->GTCR |= GTCR_CST;
    R_GPT2->GTWP  = GPT_WP_LOCK;
}

static void gpt2_stop(void)
{
    R_GPT2->GTWP  = GPT_WP_UNLOCK;
    R_GPT2->GTCR &= ~GTCR_CST;
    R_GPT2->GTINTAD = 0u;
    R_GPT2->GTWP  = GPT_WP_LOCK;

    NVIC_DisableIRQ((IRQn_Type)CONTROL_SAMPLE_IRQ);
    R_ICU->IELSR[CONTROL_SAMPLE_IRQ] = 0u;
}

// ============================================================================
// Sampling lifecycle — ADC scan + decimator/speed reset + the 20 kHz tick.
// ============================================================================

// Lazy one-time bring-up of the control hardware: PendSV priority + the GPT2
// sample-ISR vector slot + the GPT1 encoder + the H-bridge direction GPIOs.
// Deferred out of control_init() so the firmware boots CONSOLE-ONLY — no motor
// hardware is touched until the first motor mode is entered, so an idle dongle
// is byte-for-byte equivalent to the baseline at boot. Idempotent.
static bool g_hw_inited = false;

static void control_hw_ensure(void)
{
    if (g_hw_inited) return;
    NVIC_SetPriority(PendSV_IRQn, 3u);                       // below the sample ISR
    mode_vector_install(CONTROL_SAMPLE_IRQ, control_sample_isr);
    hal_encoder_setup();                                     // GPT1 x4 quadrature
    hal_gpio_config(HB_IN1_PORT, HB_IN1_PIN, true, false);   // H-bridge dir lines
    hal_gpio_config(HB_IN2_PORT, HB_IN2_PIN, true, false);
    hbridge_coast();
    g_hw_inited = true;
}

static void sampling_start(void)
{
    control_hw_ensure();
    hal_adc_scan3_setup();

    for (uint32_t i = 0; i < 3; i++) {
        g_acc1k[i] = 0; g_acc100[i] = 0; g_out1k[i] = 0; g_out100[i] = 0;
    }
    g_cnt1k = 0; g_cnt100 = 0; g_outer = 0;
    g_enc_prev100 = g_enc_pos;
    g_vel_f = 0.0f; g_velocity = 0;

    gpt2_start();
}

static void sampling_stop(void)
{
    gpt2_stop();
}

// ============================================================================
// Public API.
// ============================================================================

void control_init(void)
{
    // CONSOLE-ONLY at boot: touch NO motor hardware here — no NVIC/PendSV, no
    // vector install, no GPIO, no GPT. All of it is brought up lazily on the
    // first motor-mode entry (control_hw_ensure, via sampling_start), so an idle
    // dongle behaves exactly like the pre-control-core baseline. This keeps the
    // USB bring-up path clean and lets the real-time pieces be enabled one mode
    // at a time, with the console already live to observe.
    g_motor_mode  = MOTOR_IDLE;
    g_motor_state = MOTOR_STATE_IDLE;
    g_fault       = MOTOR_FAULT_NONE;
}

void control_service(void)
{
    // Tier 0 seam: pseudo-interlock op-complete event delivery lands here with
    // MODE_SCURVE. Nothing to do for IDLE / MANUAL.
}

uint8_t control_set_motor_mode(motor_mode_t m)
{
    if (m > MOTOR_MODE_MAX_IMPLEMENTED) return 1u;
    if (m == g_motor_mode) return 0u;

    // Entering a driving mode: free the ADC from the DSP slot.
    if (m != MOTOR_IDLE) {
        mode_set(MODE_WORKBENCH);     // DSP slot → NONE
    }

    if (g_motor_modes[g_motor_mode].on_exit) {
        g_motor_modes[g_motor_mode].on_exit();
    }
    g_motor_mode = m;
    g_fault = MOTOR_FAULT_NONE;
    if (g_motor_modes[m].on_enter) {
        g_motor_modes[m].on_enter();
    }
    return 0u;
}

motor_mode_t  control_get_motor_mode(void)  { return g_motor_mode; }
motor_state_t control_get_motor_state(void) { return g_motor_state; }

uint8_t control_motor_drive(int16_t duty)
{
    if (g_motor_mode != MOTOR_MANUAL) return 1u;
    if (duty == 0) {
        g_fault = MOTOR_FAULT_NONE;   // a stop command acknowledges/clears fault
    }
    hbridge_apply(duty);
    return 0u;
}

int32_t  control_position(void)    { return g_enc_pos; }
int32_t  control_velocity(void)    { return g_velocity; }
uint16_t control_current_raw(void) { return g_adc_raw[0]; }
int16_t  control_duty(void)        { return g_duty; }
uint8_t  control_fault(void)       { return g_fault; }

void control_encoder_reset(void)
{
    hal_encoder_reset();
    g_enc_pos      = hal_encoder_read();
    g_enc_prev100  = g_enc_pos;
    g_vel_f        = 0.0f;
    g_velocity     = 0;
}

void control_set_overcurrent(uint16_t overcurrent_raw) { g_oc_thresh = overcurrent_raw; }
void control_set_counts_per_rev(uint32_t cpr)          { g_counts_per_rev = cpr; }
uint32_t control_counts_per_rev(void)                  { return g_counts_per_rev; }

uint8_t control_dac_probe(uint8_t source, int16_t scale, int16_t offset)
{
    if (source >= PROBE_SOURCE_COUNT) return 1u;
    g_dactest.mode = DACTEST_OFF;     // probe owns the DAC now
    g_probe.source = source;
    g_probe.scale  = scale;
    g_probe.offset = offset;
    g_probe.active = true;
    return 0u;
}

void control_dac_probe_stop(void)
{
    g_probe.active = false;
}

uint16_t control_pwm_test(uint16_t counts)
{
    if (!hal_pwm_active()) {
        hal_pwm_config(20000u);     // GPT3 / GTIOC3A on D8: 20 kHz, period 2400
    }
    hal_pwm_set_raw(counts);
    return hal_pwm_period();
}

void control_dac_const(uint16_t value)
{
    g_probe.active = false;          // test owns the DAC
    g_dactest.mode = DACTEST_CONST;
    if (value > 4095u) value = 4095u;
    hal_dac_write(value);            // lazy-inits the DAC
}

uint16_t control_dac_square(uint16_t freq_hz, uint16_t low, uint16_t high)
{
    g_probe.active = false;
    if (freq_hz == 0u) { g_dactest.mode = DACTEST_OFF; return 0u; }
    if (low  > 4095u) low  = 4095u;
    if (high > 4095u) high = 4095u;
    uint32_t half = 10000u / freq_hz;        // 20 kHz / (2·freq)
    if (half < 1u) half = 1u;                // cap at Nyquist (~10 kHz)
    hal_dac_write(low);                      // init + park at low
    g_dactest.low = low; g_dactest.high = high;
    g_dactest.half_ticks = (uint16_t)half;
    g_dactest.counter = 0u; g_dactest.level = 0u;
    g_dactest.mode = DACTEST_SQUARE;
    return (uint16_t)(10000u / half);        // realized Hz
}

void control_streams(uint16_t out[9])
{
    out[0] = g_adc_raw[0]; out[1] = g_adc_raw[1]; out[2] = g_adc_raw[2];
    out[3] = g_out1k[0];   out[4] = g_out1k[1];   out[5] = g_out1k[2];
    out[6] = g_out100[0];  out[7] = g_out100[1];  out[8] = g_out100[2];
}

// ---- offline spectral-analysis support -------------------------------------

uint8_t control_analysis_start(void)
{
    if (g_motor_mode != MOTOR_IDLE) return 1u;    // motor owns the sampler
    control_hw_ensure();
    sampling_start();                             // 20 kHz ISR + decimators, motor coast
    return 0u;
}

void control_analysis_stop(void)
{
    sampling_stop();                             // chip goes offline
}

void control_spectral_arm(uint8_t rate, uint8_t channel)
{
    g_specfeed.rate    = (rate > CONTROL_RATE_100) ? CONTROL_RATE_20K : rate;
    g_specfeed.channel = (channel < 3u) ? channel : 0u;
    g_specfeed.active  = true;
}

void control_spectral_disarm(void)
{
    g_specfeed.active = false;
}

uint8_t control_encoder_stim(uint16_t rate_hz, uint8_t dir)
{
    if (rate_hz == 0u) {                          // stop
        g_encstim.active = false;
        control_analysis_stop();
        return 0u;
    }
    if (g_motor_mode != MOTOR_IDLE) return 1u;    // motor owns D4/D5 + the sampler
    uint32_t st = (uint32_t)SAMPLE_RATE_HZ / rate_hz;   // 20 kHz / rate
    if (st < 2u)      st = 2u;                     // cap ~10 kHz counts
    if (st > 0xFFFFu) st = 0xFFFFu;
    g_encstim.step_ticks = (uint16_t)st;
    g_encstim.counter    = 0u;
    g_encstim.idx        = 0u;
    g_encstim.dir        = (dir != 0u) ? 1u : 0u;
    if (control_analysis_start() != 0u) return 1u; // 20 kHz ISR + GPT1 encoder + PendSV speed
    g_encstim.active = true;
    return 0u;
}
